Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: For characters such as '|eacute|', '|uuml|', '|otilde|', '|Aacute|', and '|Utilde|', it is recommended to use the single Unicode format (NFC) rather than decomposing them into a base letter and diacritics (e.g. ``u`` + |uml|).
it_it: Per caratteri come '|eacute|', '|uuml|', '|otilde|', '|Aacute|' e '|Utilde|', si consiglia di utilizzare il formato Unicode singolo (NFC) anziché scomporli in una lettera base e segni diacritici (ad esempio ``u`` + |uml|).

source: For colors, all these syntaxes are supported (similar to CSS colors): ``0x112233``, ``#112233``, ``112233``, ``0x123``, ``#123``, ``123``.
it_it: Per i colori, sono supportate tutte queste sintassi (simili ai colori CSS): ``0x112233``, ``#112233``, ``112233``, ``0x123``, ``#123``, ``123``.

source: For complete details on position, size, coordinates, and layouts, see :ref:`coord`.
it_it: Per dettagli completi su posizione, dimensione, coordinate e layout, vedere :ref:`coord`.

source: For complete implementation details, see :ref:`EGL driver <egl_driver>`.
it_it: Per i dettagli completi sull'implementazione, vedere :ref:`Driver EGL <egl_driver>`.

source: For complete implementation details, see :ref:`GLFW driver <glfw_driver>`.
it_it: Per i dettagli completi sull'implementazione, vedere :ref:`Driver GLFW <glfw_driver>`.

source: For complete implementation details, see :ref:`OpenGL driver <opengl_driver>`.
it_it: Per i dettagli completi sull'implementazione, vedere :ref:`Driver OpenGL <opengl_driver>`.

source: For complete implementation details, see :ref:`glTF <gltf>`.
it_it: Per i dettagli completi sull'implementazione, vedere :ref:`glTF <gltf>`.

source: For currently supported font classes, please refer to the example code.
it_it: Per le classi di font attualmente supportate, fare riferimento al codice di esempio.

source: For detailed information about GStreamer, see: https://gstreamer.freedesktop.org/
it_it: Per informazioni dettagliate su GStreamer, consultare: https://gstreamer.freedesktop.org/

source: For detailed instructions, see :ref:`vg_lite_tvg`.
it_it: Per istruzioni dettagliate, vedere :ref:`vg_lite_tvg`.

source: For devices in event-driven mode, `data->continue_reading` is ignored.
it_it: Per i dispositivi in modalità event-driven, `data->continue_reading` viene ignorato.

source: For direct render mode, invoke :cpp:func:`lv_st_ltdc_create_direct` like this:
it_it: Per la modalità di rendering diretto, richiamare :cpp:func:`lv_st_ltdc_create_direct` in questo modo:

source: For each Animation you create, it accomplishes the above by providing a generic method of varying a signed integer from a start value to an end value over a specified time period.
it_it: Per ogni Animazione creata, LVGL realizza quanto sopra fornendo un metodo generico per variare un intero con segno da un valore iniziale a un valore finale in un periodo di tempo specificato.

source: For each gradient type, multiple color and opacity values can be assigned.
it_it: Per ogni tipo di gradiente è possibile assegnare più valori di colore e opacità.

source: For embedded devices, it is recommended to use the FreeType configuration files provided by LVGL:
it_it: Per i dispositivi embedded, si consiglia di utilizzare i file di configurazione FreeType forniti da LVGL:

source: For example :cpp:func:`lv_example_btn_1`.
it_it: Ad esempio :cpp:func:`lv_example_btn_1`.

source: For example ESP32 is a good candidate to create UI's with LVGL.
it_it: Ad esempio, ESP32 è un buon candidato per creare interfacce utente con LVGL.

source: For example ``"-DLV_COLOR_DEPTH=32 -DLV_USE_BUTTON=1"``.
it_it: Ad esempio ``"-DLV_COLOR_DEPTH=32 -DLV_USE_BUTTON=1"``.

source: For example ``%d%%``
it_it: Per esempio ``%d%%``

source: For example ``-DLV_CONF_PATH="/home/joe/my_project/my_custom_conf.h"``.
it_it: Per esempio ``-DLV_CONF_PATH="/home/joe/my_project/my_custom_conf.h"``.

source: For example ``img``, ``layout``, ``txt``, ``anim``.
it_it: Ad esempio ``img``, ``layout``, ``txt``, ``anim``.

source: For example ``label_dsc.base``.
it_it: Ad esempio ``label_dsc.base``.

source: For example ``style_btn`` can result in a default gray button and ``style_btn_red`` can add only a ``background-color=red`` to overwrite the background color.
it_it: Ad esempio, ``style_btn`` può generare un pulsante grigio predefinito e ``style_btn_red`` può aggiungere solo ``background-color=red`` per sovrascrivere il colore di sfondo.

source: For example ``write_cb`` looks like this:
it_it: Ad esempio, ``write_cb`` si presenta così:

source: For example a :ref:`Slider <lv_slider>` has three parts:
it_it: Ad esempio, uno :ref:`Slider <lv_slider>` ha tre parti:

source: For example if you create a grid item that spans columns 2..6 columns and rows 1..3 of the grid, the grid item will occupy 5 columns and 4 rows with the corresponding track size from the parent Grid container.
it_it: Ad esempio, se si crea un elemento grid che si estende sulle colonne 2..6 e sulle righe 1..3 della grid, l'elemento grid occuperà 5 colonne e 4 righe con le dimensioni di track corrispondenti al contenitore Grid padre.

source: For example in case of StackOverflow a notice like this can be used:
it_it: Ad esempio, nel caso di StackOverflow, è possibile utilizzare una nota come questa:

source: For example in case of lv_scale it means the length of the ticks.
it_it: Ad esempio, nel caso di lv_scale, indica la lunghezza dei tick.

source: For example one can add ``style_blue`` to the knob of a slider when it's in pressed state.
it_it: Ad esempio, è possibile aggiungere ``style_blue`` alla manopola di uno slider quando è premuto.

source: For example setting an offset of ``y=-10`` with ``align`` == :cpp:enumerator:`LV_IMAGE_ALIGN_CENTER` will move the image source up 10 pixels from the center of the Widget.
it_it: Ad esempio, impostando un offset di ``y=-10`` con ``align`` == :cpp:enumerator:`LV_IMAGE_ALIGN_CENTER`, la sorgente dell'immagine verrà spostata di 10 pixel verso l'alto rispetto al centro del Widget.

source: For example the `USB symbol <https://fontawesome.com/icons/usb?style=brands>`__.
it_it: Ad esempio, il `simbolo USB <https://fontawesome.com/icons/usb?style=brands>`__.

source: For example the event callbacks where the callback itself is available only in the code, or fonts or images if they are referring to data stored in memory.
it_it: Ad esempio, le callback degli eventi, in cui la callback stessa è disponibile solo nel codice, oppure font o immagini se fanno riferimento a dati memorizzati in memoria.

source: For example with 3 colors: 0%, 50%, 100%
it_it: Ad esempio, con 3 colori: 0%, 50%, 100%

source: For example with 3 stops it can be set like this:
it_it: Ad esempio con 3 stop può essere impostato così:

source: For example, :cpp:expr:`lv_draw_label_dsc_init(&my_label_draw_dsc)`.
it_it: Ad esempio, :cpp:expr:`lv_draw_label_dsc_init(&my_label_draw_dsc)`.

source: For example, :cpp:type:`lv_draw_label_dsc_t` is used for label drawing, :cpp:type:`lv_draw_image_dsc_t` is used for image drawing.
it_it: Ad esempio, :cpp:type:`lv_draw_label_dsc_t` viene utilizzato per il disegno di etichette, :cpp:type:`lv_draw_image_dsc_t` viene utilizzato per il disegno di immagini.

source: For example, ``"0x30-0x39 0x100-0x200"`` to specify Unicode ranges to include.
it_it: Ad esempio, ``"0x30-0x39 0x100-0x200"`` per specificare gli intervalli Unicode da includere.

source: For example, ``LV_PROPERTY_LABEL_TEXT`` is one found in ``lv_label.c``, and the properties available to all Widgets are found near the top of the ``lv_obj.c`` file.
it_it: Ad esempio, ``LV_PROPERTY_LABEL_TEXT`` si trova in ``lv_label.c``, mentre le proprietà disponibili per tutti i Widget si trovano nella parte superiore del file ``lv_obj.c``.

source: For example, ``callback="my_callback_1"`` will be exported as:
it_it: Ad esempio, ``callback="my_callback_1"`` verrà esportato come:

source: For example, ``extends="lv_slider"``.
it_it: Ad esempio, ``extends="lv_slider"``.

source: For example, ``format = LV_FONT_GLYPH_FORMAT_A4`` makes a font nearly four times larger compared to ``format = LV_FONT_GLYPH_FORMAT_A1``.
it_it: Ad esempio, ``format = LV_FONT_GLYPH_FORMAT_A4`` rende un font quasi quattro volte più grande rispetto a ``format = LV_FONT_GLYPH_FORMAT_A1``.

source: For example, ``lv_image_set_src(img, LV_SYMBOL_DUMMY "Some text")``.
it_it: Ad esempio, ``lv_image_set_src(img, LV_SYMBOL_DUMMY "Some text")``.

source: For example, a :ref:`Base Widget <base_widget>` has "main" and "scrollbar" parts, while a :ref:`Slider <lv_slider>` has "main", "indicator", and "knob" parts.
it_it: Ad esempio, un :ref:`Widget Base <base_widget>` ha le parti "main" e "scrollbar", mentre uno :ref:`Slider <lv_slider>` ha le parti "main", "indicator" e "knob".

source: For example, a ``room1_temperature`` subject's value can be set in the application when the temperature is measured, and can be bound to a label like this:
it_it: Ad esempio, il valore di un soggetto ``room1_temperature`` può essere impostato nell'applicazione quando viene misurata la temperatura e può essere associato a un'etichetta come questa:

source: For example, a button has only one part called :cpp:enumerator:`LV_PART_MAIN`.
it_it: Ad esempio, un pulsante ha una sola *parte* chiamata :cpp:enumerator:`LV_PART_MAIN`.

source: For example, a scrollbar can turn to red like this:
it_it: Ad esempio, una barra di scorrimento può diventare rossa in questo modo:

source: For example, a slider has:
it_it: Ad esempio, uno slider ha:

source: For example, a style is defined like ``<style name="red" bg_color="0xff0000"/>``.
it_it: Ad esempio, uno stile è definito come ``<style name="red" bg_color="0xff0000"/>``.

source: For example, any widget's size and position can be changed.
it_it: Ad esempio, è possibile modificare le dimensioni e la posizione di qualsiasi widget.

source: For example, assume we add a button to a parent Widget named button1 and then another button named button2.
it_it: Ad esempio, supponiamo di aggiungere un pulsante a un Widget padre denominato button1 e poi un altro pulsante denominato button2.

source: For example, create a general gray button style and create a new one for red buttons where only the new background color is set.
it_it: Ad esempio, creare uno stile generico per i pulsanti grigi e crearne uno nuovo per i pulsanti rossi, in cui viene impostato solo il nuovo colore di sfondo.

source: For example, dropdown lists.
it_it: Ad esempio, elenchi a discesa.

source: For example, finding background colors for released, pressed, checked + pressed, focused, focused + pressed, focused + pressed + checked, etc. states is quite difficult.
it_it: Ad esempio, trovare colori di sfondo per gli stati released, pressed, checked + pressed, focused, focused + pressed, focused + pressed + checked, ecc. è piuttosto difficile.

source: For example, for a 100x50 ARGB8888 buffer: ``static uint8_t buffer[100 * 50 * 4]``.
it_it: Ad esempio, per un buffer ARGB8888 100x50: ``static uint8_t buffer[100 * 50 * 4]``.

source: For example, for a :ref:`Slider <lv_slider>`:
it_it: Per esempio, per uno :ref:`Slider <lv_slider>`:

source: For example, for width: ``type="px|%|content"``.
it_it: Ad esempio, per width: ``type="px|%|content"``.

source: For example, if ``my_listitem_create(parent)`` creates a Widget named ``"list_item_#"`` with direct children ``"icon"``, ``"title"``, ``"ok_button"``, and ``"lv_label_0"``, and it is called 10 times, a specific ``"ok_button"`` can be found like this:
it_it: Per esempio, se ``my_listitem_create(parent)`` crea un Widget denominato ``"list_item_#"`` con elementi figli diretti ``"icon"``, ``"title"``, ``"ok_button"`` e ``"lv_label_0"``, e viene chiamato 10 volte, è possibile trovare un ``"ok_button"`` specifico in questo modo:

source: For example, if ``outline_pad = -width``, the outline will resemble a border.
it_it: Ad esempio, se ``outline_pad = -width``, il contorno assomiglierà a un bordo.

source: For example, if a :ref:`Text Area <lv_textarea>` has focus and you press a letter on a keyboard, the key will be sent and inserted into the text area (as :cpp:enumerator:`LV_EVENT_KEY`).
it_it: Per esempio, se una :ref:`Text Area <lv_textarea>` ha il focus e si preme una lettera sulla tastiera, il tasto verrà inviato e inserito nell'area di testo (come :cpp:enumerator:`LV_EVENT_KEY`).

source: For example, if a PNG and TTF file are located at ``"A:my_ui/v2.3/assets"``, it should be passed to ``ui_init()`` so all the used paths can be prefixed.
it_it: Ad esempio, se un file PNG e TTF si trova in ``"A:my_ui/v2.3/assets"``, deve essere passato a ``ui_init()`` in modo che tutti i percorsi utilizzati possano essere prefissati.

source: For example, if a component has ``<prop name="button_label" type="string"/>``, it can be used in a label child as ``<lv_label text="$button_label"/>``.
it_it: Ad esempio, se un componente ha ``<prop name="button_label" type="string"/>``, può essere utilizzato in un'etichetta figlia come ``<lv_label text="$button_label"/>``.

source: For example, if a pointer to a deleted Widget is stored in a Timer's :cpp:expr:`timer->user_data` field when the timer event callback is called, attempted use of that pointer will likely cause a crash because the pointer is not valid any more.
it_it: Ad esempio, se un puntatore a un Widget eliminato viene memorizzato nel campo :cpp:expr:`timer->user_data` di un Timer quando viene chiamato la callback dell'evento timer, il tentativo di utilizzare quel puntatore causerà probabilmente un crash perché il puntatore non è più valido.

source: For example, if an SD card is associated with the letter ``'S'``, a file can be reached using ``"S:/path/to/file.txt"``.
it_it: Ad esempio, se una scheda SD è associata alla lettera ``'S'``, un file può essere raggiunto utilizzando ``"S:/path/to/file.txt"``.

source: For example, if both the indev and widget sensitivity are set to 128 (0.5), the input diff will be multiplied by 0.25.
it_it: Ad esempio, se sia la sensibilità indev che quella del widget sono impostate su 128 (0,5), la differenza di input verrà moltiplicata per 0,25.

source: For example, if the Figma URL is ``https://www.figma.com/design/P8NM0qOqgWfYpbENhAKqYb``, then XXXXXX would be "P8NM0qOqgWfYpbENhAKqYb".
it_it: Ad esempio, se l'URL di Figma è ``https://www.figma.com/design/P8NM0qOqgWfYpbENhAKqYb``, allora XXXXXX sarebbe "P8NM0qOqgWfYpbENhAKqYb".

source: For example, if the draw buffer is 1/10th the size of the screen and there are 2 tiles, then 1/20th + 1/20th of the screen area will be rendered at once.
it_it: Ad esempio, se il buffer di disegno è 1/10 delle dimensioni dello schermo e ci sono 2 riquadri, verranno renderizzati contemporaneamente 1/20 + 1/20 dell'area dello schermo.

source: For example, if the recipe is named expat_2.0.1.bb, then the default value of PN will be “expat”.
it_it: Ad esempio, se la ricetta si chiama expat_2.0.1.bb, il valore di default di PN sarà “expat”.

source: For example, if the recipe is named expat_2.0.1.bb, then the default value of PV will be “2.0.1”.
it_it: Ad esempio, se la ricetta si chiama expat_2.0.1.bb, il valore predefinito di PV sarà “2.0.1”.

source: For example, if the target layer is on a 800x480 display and the layer's area is (100,100) (200,200), to render a 10x10 object in the middle, the coordinates (145,145) (154,154) should be used (not (40,40) (49,49)).
it_it: Ad esempio, se il layer target si trova su un display 800x480 e l'area del layer è (100,100) (200,200), per visualizzare un oggetto 10x10 al centro, è necessario utilizzare le coordinate (145,145) (154,154) (non (40,40) (49,49)).

source: For example, if there are 4 CPU cores, one core can draw the screen's background while the other 3 must wait until it is finished.
it_it: Ad esempio, se ci sono 4 core della CPU, un core può disegnare lo sfondo dello schermo mentre gli altri 3 devono attendere il completamento.

source: For example, if there is 400 px space remaining and 3 child Widgets with non-zero grow values:
it_it: Ad esempio, se ci sono 400 px di spazio rimanenti e 3 widget figlio con valori di crescita diversi da zero:

source: For example, if three PNG images are cached, they will consume memory while they are open.
it_it: Ad esempio, se tre immagini PNG sono memorizzate nella cache, consumeranno memoria mentre sono aperte.

source: For example, if you press a Widget it will automatically go to the :cpp:enumerator:`LV_STATE_FOCUSED` and :cpp:enumerator:`LV_STATE_PRESSED` states.
it_it: Ad esempio, se si preme un Widget, questo passerà automaticamente agli stati :cpp:enumerator:`LV_STATE_FOCUSED` e :cpp:enumerator:`LV_STATE_PRESSED`.

source: For example, in :cpp:enumerator:`LV_DISPLAY_RENDER_MODE_DIRECT` mode on an 800x480 screen, the display buffer is 800x480 = 375k pixels.
it_it: Ad esempio, in modalità :cpp:enumerator:`LV_DISPLAY_RENDER_MODE_DIRECT` su uno schermo 800x480, il buffer di visualizzazione è 800x480 = 375k pixel.

source: For example, let's say ``my_button.xml`` describes some feature of a button, but some setters, special APIs, or extra features need to be added.
it_it: Ad esempio, supponiamo che ``my_button.xml`` descriva alcune funzionalità di un pulsante, ma che sia necessario aggiungere alcuni setter, API speciali o funzionalità extra.

source: For example, on pressing a button its background color can be animated to the pressed color over 300 ms.
it_it: Ad esempio, premendo un pulsante, il suo colore di sfondo può essere animato per 300 ms fino a raggiungere il colore del pulsante premuto.

source: For example, search for ``libdrm``.
it_it: Ad esempio, cercare ``libdrm``.

source: For example, setting a 500 ms transition time in the default state means that when the Widget goes to the default state a 500 ms transition time is applied.
it_it: Ad esempio, impostando un tempo di transizione di 500 ms nello stato di default, quando il widget passa allo stato di default viene applicato un tempo di transizione di 500 ms.

source: For example, setting a different background color for the default and pressed states.
it_it: Ad esempio, impostando un colore di sfondo diverso per gli stati di default e premuto.

source: For example, some MCUs come with hardware that is very good (and fast) at certain types of drawing tasks.
it_it: Ad esempio, alcuni MCU sono dotati di hardware molto valido (e veloce) per determinati tipi di attività di disegno.

source: For example, table cells.
it_it: Ad esempio, celle di tabella.

source: For example, tabview tabs.
it_it: Ad esempio tab di tabview.

source: For example, the ESP32 family is a good candidate to create UIs with LVGL.
it_it: Ad esempio, la famiglia ESP32 è un'ottima candidata per creare interfacce utente con LVGL.

source: For example, the following sets pixels with *index==3* to red.
it_it: Ad esempio, il seguente comando imposta i pixel con *index==3* sul rosso.

source: For example, the touchpad still sees the whole resolution, and the values need to be converted to the active LVGL display area.
it_it: Ad esempio, il touchpad continua a visualizzare l'intera risoluzione e i valori devono essere convertiti nell'area di visualizzazione LVGL attiva.

source: For example, this can be used to manually close a message box by simulating a button press (although there are simpler ways to do this):
it_it: Ad esempio, questo può essere utilizzato per chiudere manualmente una finestra di messaggio simulando la pressione di un pulsante (anche se esistono modi più semplici per farlo):

source: For example, this code makes the scrollbar blue while the Widget is being scrolled:
it_it: Ad esempio, questo codice rende la barra di scorrimento blu durante lo scorrimento del Widget:

source: For example, this is how a scroll gesture can be emulated:
it_it: Ad esempio, ecco come può essere emulato una "gesture" di scorrimento:

source: For example, to add some style properties to an XML-defined style:
it_it: Ad esempio, per aggiungere alcune proprietà a uno stile definito in XML:

source: For example, to build a shared library for ARMv8:
it_it: Ad esempio, per creare una libreria condivisa per ARMv8:

source: For example, to create a widget:
it_it: Ad esempio, per creare un widget:

source: For example, to support 2 touches, create 2 pointer input devices.
it_it: Ad esempio, per supportare 2 tocchi, creare 2 dispositivi di input puntatore.

source: For example, use :cpp:expr:`lv_xml_register_event_cb(scope, "event_cb_name", the_callback)` to connect a callback to a name.
it_it: Ad esempio, si usa :cpp:expr:`lv_xml_register_event_cb(scope, "event_cb_name", the_callback)` per collegare una callback a un nome.

source: For example, use the :ref:`lv_win` widget to add a title bar with buttons, or build custom decorations from basic widgets like containers, labels, and buttons.
it_it: Ad esempio, usare il widget :ref:`lv_win` per aggiungere una barra del titolo con pulsanti o creare decorazioni personalizzate da widget di base come contenitori, etichette e pulsanti.

source: For example, using an High-Dynamic-Range (HDR) image of a forest will make your 3D model appear to be sitting in a forest.
it_it: Ad esempio, l'utilizzo di un'immagine HDR (High Dynamic Range) di una foresta farà sì che il modello 3D sembri essere immerso in una foresta.

source: For example, using bash to build packages for the native machine, PN is bash-native.
it_it: Ad esempio, utilizzando bash per compilare pacchetti per la macchina nativa, PN è bash-native.

source: For example, with ``opa_layered = 140``, only 10 lines of the layer can be rendered at a time, then the next 10 lines, and so on.
it_it: Ad esempio, con ``opa_layered = 140``, è possibile eseguire il rendering di solo 10 righe del layer alla volta, poi delle 10 righe successive e così via.

source: For example, you can create meters, charts, bars, and sliders based on the currently attached sensors.
it_it: Ad esempio, è possibile creare misuratori, grafici, barre e slider in base ai sensori attualmente collegati.

source: For example, you can set the font once in the screen's style and all text on that screen will inherit it by default, unless the font is specified on the widget or one of its parents.
it_it: Ad esempio, è possibile impostare il font una volta nello stile della schermata e tutto il testo su quella schermata lo erediterà per default, a meno che il font non sia specificato nel widget o in uno dei suoi genitori.

source: For example, you can simply write ``<bind_state_if_gt>`` instead.
it_it: Ad esempio, si può semplicemente scrivere ``<bind_state_if_gt>``.

source: For example, you can use `FreeType <https://www.freetype.org/>`__ to real-time render glyphs from TTF fonts or use an external flash to store the font's bitmap and read them when the library needs them.
it_it: Ad esempio, è possibile utilizzare `FreeType <https://www.freetype.org/>`__ per il rendering in tempo reale dei glifi dei font TTF o utilizzare una flash esterna per memorizzare la bitmap del font e leggerla quando la libreria ne ha bisogno.

source: For example, you can use a layer to hold all the configurations for a particular piece of hardware.
it_it: Ad esempio, è possibile utilizzare un layer per contenere tutte le configurazioni di un particolare componente hardware.

source: For example, you can use it to debug a device connected to a PC via JLink, which provides a GDB server.
it_it: Ad esempio, è possibile utilizzarlo per eseguire il debug di un dispositivo connesso a un PC tramite JLink, che fornisce un server GDB.

source: For example, you could have a colorful theme on a TFT and monochrome theme on a secondary monochrome display.
it_it: Ad esempio, è possibile avere un tema colorato su un TFT e un tema monocromatico su un display monocromatico secondario.
